{
    "slides": {
        "home": {
            "title": "Sonificando el Epigenoma",
            "subtitle": "<strong>Sistema Interactivo de Sonificación Epigenética</strong>",
            "describe": "Esta <a href=\"https://beast.cal.bham.ac.uk/sounding/index.html\"style=\"text-align: center; color:#d1a727\"target=\"_blank\">App</a> es una plataforma en línea donde cualquiera puede sonificar datos epigenéticos tomados del roble inglés.",
            "navinstructions": "Haz clic en la flecha hacia abajo en la esquina inferior derecha de la pantalla<br><br>o <br><br> pulsa la tecla de flecha ABAJO en tu teclado"
        },
        "about": {
            "discussion": "La <a href=\"https://beast.cal.bham.ac.uk/sounding/index.html\"style=\"color:#d1a727\"target=\"_blank\">App Sonificando el Epigenoma</a> fue desarrollada como parte de una colaboración entre la Universidad de Birmingham, el proyecto MEMBRA Treescape, la Universidad de los Andes y el Centro Nacional de las Artes (Bogotá, Colombia). Este proyecto utiliza la práctica de la sonificación de datos para crear conciencia e incentivar el interés en la ciencia. A través de talleres y actividades que apoyan la creación de herramientas y recursos personalizados, generará impacto para diversos usuarios, incluyendo artistas, educadores, público interesado en la ciencia y personas con discapacidad visual.<br><br>¡Aquí puedes explorar y jugar! El sitio web también contiene información sobre la ciencia de la epigenética, la sonificación de datos y la síntesis de sonido, si quieres descubrir más sobre la teoría detrás de la app.<br><br><br>Utiliza los botones ARRIBA/ABAJO en tu teclado o en la esquina inferior derecha de la pantalla para navegar entre secciones dentro de un tema.<p>Usa los botones DERECHA/IZQUIERDA para navegar entre temas.</p><p>Usa el botón de menú en la esquina inferior izquierda de la pantalla para acceder a cualquiera de los recursos.</p>",
            "instructions": "Haz clic aquí para instrucciones detalladas sobre cómo usar la app."
        },
        "credits": {
            "creditsinner": "<strong>El proyecto Sonificando el Epigenoma es una colaboración entre:</strong><br><p>La Universidad de Birmingham</p><br><p>Universidad de los Andes</p><br><p>MEMBRA</p><br><p>BEAST / El Centro de Música Electrónica</p><br><p>Centro Nacional de las Artes</p><br><p>Se basa en investigaciones realizadas para el <a href=\"https://www.birmingham.ac.uk/index.aspx\">proyecto IPSOS</a> (Sistema Interactivo de Sonificación Física) en colaboración con el proyecto <a href=\"http://artcms.web.cern.ch/artcms/dark-matter-music-meets-physics/\">art@CMS</a>.</p><br><hr><br><p><strong>Miembros del equipo:</strong></p><br><p>Dr. Joe He (Bioinformático)</p><br><p>Dr. Marco Catoni (Bioinformático)</p><br><p>Prof. Santiago Lozano (Compositor)</p><br><p>Prof. Jorge Gregorio García (Compositor)</p><br><p>Prof. Scott Wilson (Compositor/Programador)</p><br><p>Dr. Milad Mardakheh (Compositor/Programador)</p><br><p>Dr. Konstantinos Vasilakos (IPSOS) (Compositor/Programador)</p><br><p>Dr. Tom McCauley (IPSOS) (Físico/Programador)</p>"
        },
        "epigenetics": {
            "epigenetics": "Epigenética"
        },
        "whatisit": {
            "whatisit": "¿Qué es?",
            "epigen-discuss": "¿Qué hace que un roble sea un roble? ¿Son las ramas o las hojas? ¿Las raíces profundas bajo tierra? Sin duda, la forma única de las hojas y su majestuosa estatura son incomparables, pero en los últimos años, los biólogos han comenzado a examinar más el ADN de los seres vivos para distinguir entre diferentes especies y clasificarlas.<p>Cada ser vivo tiene un código de ADN, que se compone de 4 nucleótidos, referidos por las iniciales de sus nombres: A, C, T y G. Este código es responsable de instruir a la célula sobre qué proteínas fabricar, cómo y cuándo hacerlo, lo que en última instancia forma el organismo. Al observar este código, los biólogos pueden agrupar organismos similares en especies, familias, reinos y dominios.</p><p>El ADN se hereda de los padres a los descendientes, por eso los hijos suelen parecerse a los padres, ya seas humano, gato, pez o roble. Pero evidencias recientes muestran que las modificaciones en el ADN que no son de la secuencia principal, llamadas epigenéticas, tienen efectos significativos en las características del organismo. Por ejemplo, las gatas carey son hijas de un gato negro y uno naranja. Los parches de color provienen de la expresión de las partes negras y naranjas de cada padre, haciendo de la gata carey una verdadera quimera.</p><p>Estudiamos el epigenoma de árboles en bosques del Reino Unido y Colombia. El epigenoma es afectado por condiciones ambientales asociadas al cambio climático como heladas, sequía, infestación de insectos y aumento de CO2. Usamos la última técnica, la secuenciación de genoma completo con bisulfito, para identificar el patrón del epigenoma.</p><p>Después de la secuenciación, asociamos los cambios de rasgos a diferentes marcas epigenómicas para entender mejor los árboles. Por ejemplo, si una región particular del epigenoma se asocia con la resistencia a enfermedades, entonces rastrear su prevalencia en una población nos ayudará a entender cuán resistente puede ser un bosque a las enfermedades.</p><p>Este es un proyecto científico activo y en curso. La secuencia del epigenoma en varias etapas de procesamiento está disponible para que la sonifiques en esta app.</p>"
        },
        "synthesis-title": {
            "synthesis": "Síntesis de Sonido"
        },
        "synthesis-intro": {
            "synthesis-discussion": "<p style=\"text-align: center\">    <img src=\"https://upload.wikimedia.org/wikipedia/commons/f/ff/Moog_One_Synthesizer.jpg\"style=\"background:none; border:none; box-shadow:none;  width: clamp(500px, 45vw, 85vw); max-width:100%;\"title=\"Synthesizer\">    </p><figcaption style=\"text-align: center; opacity:0.5; font-size:0.5em;\"> <em>Imagen: Wikimedia Commons: Qwave</em></figcaption><p></p><br>La síntesis de sonido es la técnica de generar sonido, usando hardware o software electrónico, desde cero. El uso más común de la síntesis es musical, donde instrumentos electrónicos llamados sintetizadores se usan para interpretar y grabar música.<p>El sonido es la vibración percibida (oscilación) del aire resultado de la vibración de una fuente sonora. Podemos describir esa vibración regular (periódica) en términos de la suma de vibraciones más simples (armónicos). Una oscilación periódica y la forma de onda resultante se puede describir en términos de la suma de sus armónicos. Cada armónico es una onda sinusoidal simple (llamada tono puro) con su propia frecuencia y amplitud.</p><br><p style=\"text-align: center\">    <img src=\"https://upload.wikimedia.org/wikipedia/commons/4/44/Simple_harmonic_motion.png\"style=\"background:none; border:none; box-shadow:none;  width: clamp(400px, 30vw, 70vw); max-width:100%;\"title=\"Simple harmonic motion\">    </p><figcaption style=\"text-align: center; opacity:0.5; font-size:0.5em;\"> <em>Imagen: Wikimedia Commons: Maksim</em></figcaption><p></p><br><p>Este oscilador crea sonido repitiendo esta forma de onda a una frecuencia particular. La forma de la onda puede cambiar el sonido producido y así cambiar el timbre del sonido:</p><br><p><strong>1. Onda Senoidal</strong></p><p style=\"text-align: center\">    <img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Simple_sine_wave.svg/200px-Simple_sine_wave.svg.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(333px, 20vw, 70vw); max-width:100%;\"title=\"Sine wave\"></p><p style=\"text-align: center\">    <audio controls=\"\"style=\"width: clamp(333px, 35vw, 500px); max-width:100%; zoom:110%; height:45px;\">        <source type=\"audio/mpeg\"src=\"media/sine.mp3\">        Tu navegador no soporta el elemento de audio.    </audio></p><p><strong>2. Onda Cuadrada</strong></p><p style=\"text-align: center\">    <img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Square_wave.svg/200px-Square_wave.svg.png\"style=\"background:none; border:none; box-shadow:none;  width: clamp(333px, 20vw, 70vw); max-width:100%;\"title=\"Square wave\"></p><p style=\"text-align: center\">    <audio controls=\"\"style=\"width: clamp(333px, 35vw, 500px); max-width:100%; zoom:110%; height:45px;\">        <source type=\"audio/mpeg\"src=\"media/square.mp3\">        Tu navegador no soporta el elemento de audio.    </audio></p><p><strong>3. Onda Triangular</strong></p><p style=\"text-align: center\">    <img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Triangle_wave.svg/200px-Triangle_wave.svg.png\"style=\"background:none; border:none; box-shadow:none;  width: clamp(333px, 20vw, 70vw); max-width:100%;\"title=\"Triangle wave\"></p><p style=\"text-align: center\">    <audio controls=\"\"style=\"width: clamp(333px, 35vw, 500px); max-width:100%; zoom:110%; height:45px;\">        <source type=\"audio/mpeg\"src=\"media/triangle.mp3\">        Tu navegador no soporta el elemento de audio.    </audio></p><p><strong>4. Onda Diente de Sierra</strong></p><p style=\"text-align: center\">    <img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Sawtooth_wave.svg/200px-Sawtooth_wave.svg.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(333px, 20vw, 70vw); max-width:100%;\"title=\"Sawtooth wave\"></p><p style=\"text-align: center\">    <audio controls=\"\"style=\"width: clamp(333px, 35vw, 500px); max-width:100%; zoom:110%; height:45px;\">        <source type=\"audio/mpeg\"src=\"media/sawtooth.mp3\">        Tu navegador no soporta el elemento de audio.    </audio></p><p></p><figcaption style=\"text-align: center; opacity:0.5; font-size:0.5em;\"> <em>Todas las imágenes de formas de onda: Wikimedia Commons: Omegatron</em></figcaption><p></p>"
        },
        "adsr-and-params": {
            "adsr-description": "<h2 id=\"adsr-envelope\">Envolvente ADSR</h2><p>Una envolvente describe cómo cambia un sonido a lo largo del tiempo. Usando una envolvente ASDR podemos controlar y ajustar el sonido del sintetizador como prefiramos usando los siguientes parámetros:</p><ul><li><p><strong>Ataque</strong>: es el tiempo que toma desde el inicio hasta alcanzar el nivel máximo, comenzando cuando se pulsa la tecla.</p></li><li><p><strong>Decaimiento</strong>: es el tiempo que toma descender desde el nivel de ataque hasta el nivel de sostenido designado.</p></li><li><p><strong>Sostenido</strong>: es el nivel durante la parte principal de la duración del sonido, hasta que se suelta la tecla.</p></li><li><p><strong>Relajación</strong>: es el tiempo que tarda en decaer desde el nivel de sostenido hasta cero después de soltar la tecla.</p></li></ul><p>Mientras que ataque, decaimiento y relajación se refieren a tiempo, sostenido se refiere al nivel.</p>",
            "adsr-examples": "<p><strong>Ejemplos:</strong><br><br>                           1. Sonido de ataque corto.<br><br></p><p style=\"text-align: left\">    <audio controls=\"\"style=\"width: clamp(333px, 35vw, 500px); max-width:100%; zoom:110%; height:45px;\">        <source src=\"media/short attack sound.mp3\"type=\"audio/mpeg\">        Tu navegador no soporta el elemento de audio.    </audio></p>                        <br>                           2. Sonido largo, sostenido y grave.                        <br><br><p style=\"text-align: left\">    <audio controls=\"\"style=\"width: clamp(333px, 35vw, 500px); max-width:100%; zoom:110%; height:45px;\">        <source src=\"media/long sustained sound.mp3\"type=\"audio/mpeg\">        Tu navegador no soporta el elemento de audio.    </audio></p>                        <br>                           3. Sonido en secuencia.                        <br><br><p style=\"text-align: left\">    <audio controls=\"\"style=\"width: clamp(333px, 35vw, 500px); max-width:100%; zoom:110%; height:45px;\">        <source src=\"media/Sequence.mp3\"type=\"audio/mpeg\">        Tu navegador no soporta el elemento de audio.    </audio></p>",
            "other-params-discussion": "<p><strong>Otros parámetros incluidos en la app:</strong></p><br><p><em>Dependiendo del instrumento y los efectos seleccionados, los parámetros sonoros variarán. A continuación algunos de los más comunes:</em></p><br><ul><li><p><strong>Desafinación</strong>: describe el efecto al afinar un oscilador más agudo o más grave respecto a un segundo oscilador. Esto produce un engrosamiento del sonido o puede producir un efecto armónico si el intervalo de afinación es suficientemente amplio.</p><br></li><li><p><strong>Nota MIDI</strong>: altura musical (qué tan grave o agudo). Altura de la tecla presionada con un valor entre 0 y 127.</p><br></li><li><p><strong>Duración</strong>: cantidad de tiempo que sonará un sonido.</p><br></li><li><p><strong>Tempo</strong>: velocidad de reproducción en pulsos por minuto (BPM).</p><br></li><li><p><strong>Escala/Modo</strong>: la escala o modo usado para las notas MIDI mapeadas.</p><br></li><li><p><strong>Acorde</strong>: partículas que suenan simultáneamente.</p><br></li><li><p><strong>Secuencia</strong>: partículas que suenan por separado.</p><br></li><li><p><strong>Parámetros de efectos</strong>: cada efecto añadido traerá consigo su propio conjunto de parámetros para el mapeo.                  </p></li></ul>"
        },
        "sonification": {
            "sonification-title": "Sonificación"
        },
        "what-is-sonification": {
            "sonification-discussion": "<h2 id=\"what-is-it\">¿Qué es?</h2><br><p style=\"text-align: center\">    <img src=\"https://upload.wikimedia.org/wikipedia/commons/c/c4/Scatter_plot.jpg\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 25vw, 85vw); max-width:100%;\"title=\"Data visualization\"></p><br><p>Al igual que en la imagen anterior, la visualización de datos muestra y comunica información (los datos) mediante medios visuales, por ejemplo, gráficos, diagramas, etc. Una visualización auditiva es cualquier visualización que usa el sonido en lugar de imágenes (puntos, líneas, formas, etc.) para mostrar los datos. La sonificación es la transformación de datos de cualquier tipo (números, imágenes, texto) en audio no hablado para representar información.</p><p>Los seres humanos naturalmente tienen la capacidad superior de reconocer cambios y patrones en las diferentes propiedades del sonido a lo largo del tiempo, como altura (frecuencia), volumen, timbre, textura, etc. Esto se llama percepción auditiva. La sonificación aprovecha esta habilidad y traduce las relaciones de los datos en cambios en las propiedades del sonido para que puedan ser comprendidas por el oyente.</p><p>¡Un ejemplo muy simple de sonificación es el timbre de una puerta! La información, que es el hecho de que alguien está en la puerta, se transforma en un sonido distintivo para que, cada vez que lo escuchamos, podamos interpretarlo y comprenderlo inmediatamente.</p><p>A continuación hay otro ejemplo simple de sonificación. Escucha cómo cambia la altura del sonido según la posición de la variable y al movernos a lo largo del eje x en el gráfico de la parábola.</p><br><p style=\"text-align: center\">    <img src=\"media/Parabolic_graph_convex.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 20vw, 85vw); max-width:100%;\"title=\"Parabolic arc\"height=\"auto\">    </p><figcaption style=\"text-align: center; opacity:0.5; font-size:0.5em;\"> <em>Imagen: Wikimedia Commons: Nicostella</em></figcaption><p></p><br><p style=\"text-align: center\">    <audio controls=\"\"style=\"width: clamp(333px, 35vw, 500px); max-width:100%; zoom:110%; height:45px;\">        <source src=\"media/parabola pitch.mp3\"type=\"audio/mpeg\">        Tu navegador no soporta el elemento de audio.    </audio></p>"
        },
        "sonification-what-for": {
            "sonification-what-for": "<h2 id=\"what-is-it-for\">¿Para qué sirve?</h2><br><p style=\"text-align: center\">    <img src=\"https://cdn.pixabay.com/photo/2017/12/24/00/30/clock-3036245_1280.jpg\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"alarm clock\"></p><br><p>La sonificación es un proceso muy útil y también común en nuestra vida diaria. Desde funciones tan simples como golpear una sandía para saber si está madura o dulce, hasta sonidos de alerta producidos por diferentes tecnologías y dispositivos como alarmas, teléfonos, computadoras, autos, etc., o para analizar cambios y patrones en datos complejos, usamos y dependemos de la sonificación en una gran variedad de trabajos y tareas.<br><br></p><h3 id=\"functions-of-sonification\">Funciones de la sonificación</h3><br><p style=\"text-align: center\">    <img src=\"https://upload.wikimedia.org/wikipedia/commons/0/04/Normal_electrocardiogram.jpg\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"ECG\">    </p><figcaption style=\"text-align: center; opacity:0.5; font-size:0.5em;\"> <em>Imagen: Wikimedia Commons: medipics1066</em></figcaption><p></p><br><ol><li><p><strong>Alarmas, alertas y avisos</strong></p><p>  Las alertas y notificaciones son sonidos usados para indicar que algo ha ocurrido, está a punto de ocurrir, o que el oyente debe atender algo en el entorno. Suelen ser simples y especialmente llamativos. Por ejemplo, el pitido del microondas es una sonificación que indica que el tiempo de cocción ha finalizado.</p></li><li><p><strong>Mensajes de estado, proceso y monitoreo</strong></p><p>  Hay situaciones donde el oyente debe estar constantemente consciente del estado actual o en curso de un sistema o proceso. Por ejemplo, los cirujanos deben conocer el ritmo cardíaco de los pacientes en todo momento durante la cirugía y, por ello, usan sistemas de monitoreo cardíaco que, además de visualizaciones, usan sonificación para representar los latidos.</p></li><li><p><strong>Exploración de datos</strong></p><p>  Esto es lo que generalmente se entiende por “sonificación”, y la intención es transmitir información sobre un conjunto de datos completo o aspectos relevantes del mismo. Las sonificaciones para exploración de datos se diferencian de los indicadores de estado o proceso en que usan el sonido para mostrar cómo los valores de los datos se conectan entre sí, en lugar de dar información sobre un estado momentáneo como en las alertas y procesos.</p></li><li><p><strong>Arte, entretenimiento, deportes y ejercicio</strong></p><p>  Entre sus diferentes aplicaciones, la sonificación y los despliegues auditivos se han usado para permitir que niños y adultos con discapacidad visual participen en deportes en equipo, o como medio para compartir la experiencia y emoción de exhibiciones dinámicas con los invidentes.</p><p>  Además, las sonificaciones de eventos y conjuntos de datos pueden usarse como base para composiciones musicales, instalaciones y obras de arte sonoro. Si bien los diseñadores y/o compositores a menudo intentan transmitir algo al oyente mediante estas sonificaciones, no es únicamente con fines informativos.</p></li></ol>"
        },
        "sonification-techniques": {
            "sonification-techniques-and-approaches": "<h2 id=\"sonification-techniques-and-approaches\">Técnicas y enfoques de sonificación</h2><br><p style=\"text-align: center\">    <img src=\"https://upload.wikimedia.org/wikipedia/commons/1/1e/NOSAR_Kursk_sesmic_readings.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"seismic waves\"></p><ul><li><p><strong>Iconos auditivos y Earcons</strong></p><ul><li><em>Iconos auditivos</em>: son sonidos comunicativos cortos que tienen una relación analógica con el proceso o acción que representan. Es decir, el sonido realmente <em>suena</em> como lo que representa. Por ejemplo, vaciar la papelera de tu ordenador haciendo el sonido de papel arrugándose, o el siguiente ejemplo indicando el flujo de agua o líquido en un sistema.</li></ul>  <p style=\"text-align: center\">      <audio controls=\"\"style=\"width: clamp(333px, 35vw, 500px); max-width:100%; zoom:110%; height:45px;\">          <source src=\"media/Auditory Icon - river flowing.mp3\"type=\"audio/mpeg\">              Tu navegador no soporta el elemento de audio.      </audio>  </p><ul><li><em>Earcons</em>: en cambio, usan sonidos solo como símbolos de acciones o procesos; los sonidos no necesariamente <em>suenan</em> como esas acciones. Por ejemplo, el simple pitido de tu móvil al recibir un mensaje de texto. Abajo un ejemplo de un earcon que representa la acción de minimizar o hacer algo más pequeño.</li></ul>  <p style=\"text-align: center\">      <audio controls=\"\"style=\"width: clamp(333px, 35vw, 500px); max-width:100%; zoom:110%; height:45px;\">          <source src=\"media/Earcon - minimizing.mp3\"type=\"audio/mpeg\">          Tu navegador no soporta el elemento de audio.      </audio>  </p>  <br></li><li><p><strong>Audificación</strong> es el método más primario de sonificación directa, donde las formas de onda se traducen directamente en sonido. Por ejemplo, las ondas sísmicas que viajan por la corteza terrestre como resultado de vibraciones de placas tectónicas a lo largo de mucho tiempo han sido audificadas para que podamos escuchar terremotos reales. Este enfoque puede requerir que las formas de onda sean modificadas en frecuencia o tiempo [aceleradas o ralentizadas] para estar dentro del rango audible humano.</p><br></li><li><p><strong>Sonificación basada en modelos</strong> es una técnica más compleja donde, mediante simulaciones computacionales, se construye un modelo virtual de los datos que produce sonidos según las relaciones dentro de los datos, conforme el usuario interactúa con él. El modelo es como un instrumento que el usuario 'toca' y su interacción dirige la sonificación.</p><br></li><li><p><strong>Sonificación por mapeo de parámetros</strong> representa cambios en alguna dimensión de los datos con cambios en una dimensión acústica (del sonido) para producir una sonificación. Como ya vimos, el sonido sintetizado tiene muchas dimensiones o parámetros cambiables como forma de onda, altura, duración, parámetros de la envolvente ADSR, etc.</p></li></ul><p><br><br></p><h3 id=\"what-is-a-mapping\">¿Qué es un 'mapeo'?</h3><p>El mapeo o data-mapping es el proceso de crear relaciones directas o indirectas entre dos conjuntos de datos distintos, de manera que un cambio en uno produzca un cambio relativo en el otro.</p><p>¿Recuerdas el ejemplo anterior de la sonificación del gráfico de parábola? Eso es sonificación por mapeo de parámetros, ya que el parámetro y se mapea directamente a la altura del sonido. Podemos crear un mapeo distinto para el mismo gráfico, pero esta vez hacia el volumen (amplitud) del sonido en vez de su altura.</p><br><p style=\"text-align: center\">    <img src=\"media/Parabolic_graph_convex.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 20vw, 85vw); max-width:100%;\"title=\"Parabolic arc\"height=\"auto\">    </p><figcaption style=\"text-align: center; opacity:0.5; font-size:0.5em;\"> <em>Imagen: Wikimedia Commons: Nicostella</em></figcaption><p></p><br><p style=\"text-align: center\">    <audio controls=\"\"style=\"width: clamp(333px, 35vw, 500px); max-width:100%; zoom:110%; height:45px;\">        <source src=\"media/parabola amp.mp3\"type=\"audio/mpeg\">            Tu navegador no soporta el elemento de audio.    </audio>                             </p>"
        },
        "mapping-topology": {
            "mapping-topology": "<h3 id=\"mapping-topology\">Topología de Mapeo</h3> <br> <p style=\"text-align: center\">     <img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/NetTransformer_Internet_BGP_map.jpg/1024px-NetTransformer_Internet_BGP_map.jpg\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"Mapping topology\">     </p><figcaption style=\"text-align: center; opacity:0.5; font-size:0.5em;\"> <em>Imagen: Wikimedia Commons: Niau33</em></figcaption> <p></p> <br><p> El término <em>topología</em> se usa en muchos campos de estudio y tiene un significado y aplicación distinta en cada uno. Sin embargo, en matemáticas generales, la topología nos dice cómo los elementos de un conjunto se relacionan espacialmente entre sí.</p><p> Por ejemplo, el sonido producido por el cambio de estado del agua en una tetera silbante al acercarse al punto de ebullición. Al aumentar la temperatura del agua, la frecuencia (altura) del silbido también sube hasta un punto donde el usuario sabe que es hora de apagar la estufa y servir el agua. Aquí tenemos un simple <strong>mapeo uno a uno</strong> entre un parámetro, que es la temperatura del agua, y otro que es la frecuencia/altura del sonido.</p> <p style=\"text-align: center\">     <img src=\"media/onetoonemappnig.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"one-to-one mapping\"> </p><p> Los mapeos uno a uno no son el único tipo de mapeo de características de datos a parámetros sonoros. Un segundo tipo es mapear una característica de datos (la temperatura del agua en el mismo ejemplo) a varios parámetros sonoros a la vez. Por ejemplo, forma de onda, altura y duración. Esto se conoce como <strong>mapeo uno a muchos</strong> o <strong>mapeo divergente</strong></p> <p style=\"text-align: center\">     <img src=\"media/onetomany.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"one-to-many mapping\"> </p><p> Un tercer tipo es <strong>muchos a uno</strong> o <strong>mapeo convergente</strong>, que es lo contrario: múltiples características de datos distintas (temperatura, presión, acidez) se mapean a un solo parámetro sonoro (altura) y tienen un efecto colectivo en él.</p> <p style=\"text-align: center\">     <img src=\"media/manytoone.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"many-to-one mapping\"> </p>"
        },
        "functions-of-pm-sonification": {
            "pm-sonification-functions": "<h2 id=\"functions-of-parameter-mapping-sonification\">Funciones de la sonificación por mapeo de parámetros</h2> <br><p> La sonificación por mapeo de parámetros es útil en una amplia gama de aplicaciones y tareas complejas, incluyendo navegación, seguimiento cinemático, monitoreo médico, ambiental, geofísico, oceanográfico y astrofísico. Además de conjuntos de datos numéricos, se ha utilizado para sonificar imágenes estáticas y en movimiento. Por ejemplo, la sonificación del movimiento humano se usa en medicina para diagnóstico y rehabilitación, y también para entrenamiento deportivo (incluyendo golf, remo, patinaje artístico y tai-chi).</p> <br><h3 id=\"in-arts-and-music\">En las Artes y la Música</h3> <br> <p style=\"text-align: center\">     <img src=\"https://live.staticflickr.com/8801/28547836316_b10a879399_z_d.jpg\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"A musical performance\">     </p><figcaption style=\"text-align: center; opacity:0.5; font-size:0.5em;\"> <em>Imagen: Flickr: smokeghost</em></figcaption> <p></p> <p style=\"text-align: center\">     <img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/AlvinLucier-MusicForSoloPerformer-DenHaag2010.jpg/431px-AlvinLucier-MusicForSoloPerformer-DenHaag2010.jpg\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"Alvin Lucier music for solo performer\">     </p><figcaption style=\"text-align: center; opacity:0.5; font-size:0.5em;\"> <em>Imagen: Flickr: pablosanz</em></figcaption> <p></p><p> El mapeo de parámetros es una de las técnicas de sonificación más utilizadas en la música, y a veces también se le llama <strong>musificación</strong>. Aquí algunos ejemplos de obras musicales que emplean esta técnica:</p><ul><li><p>   El mapeo de procesos estadísticos y estocásticos al sonido en <em>Metastasis</em> (1965) y otras obras de Iannis Xenakis.</p></li><li><p>   Alvin Lucier (imagen superior) tocó un conjunto de instrumentos de percusión usando las ondas alfa generadas por su cerebro (sonificación EEG) en su pieza <em>Music for Solo Performer</em> (1965).</p></li><li><p>   Charles Dodge compuso la obra titulada <em>The Earth's Magnetic Field</em> (1970), donde el índice <em>Kp</em> que describe las fluctuaciones del campo magnético terrestre provocadas por el viento solar, se mapea a las alturas de escalas diatónicas y cromáticas.</p></li><li><p>   John Dunn y Mary Anne Clarke compusieron la obra extendida <em>Life Music: The Sonification of Proteins</em> (1999), en la que diferentes patrones de aminoácidos y plegamiento de proteínas se mapean a la altura e instrumentación.</p></li><li><p>   <em>Antarktika</em> (2006) de Frank Halbig traduce datos de núcleos de hielo que reflejan el desarrollo climático de nuestro planeta en una partitura para cuarteto de cuerdas.</p></li><li><p>   <em>Jiyeh</em> (2008) de Jonathan Berger, mapea los contornos de la dispersión de petróleo de un derrame catastrófico en el mar Mediterráneo. Utilizando una secuencia de imágenes satelitales, la propagación del petróleo a lo largo del tiempo fue sonificada y escalada para dar una idea de la magnitud del evento ambiental.</p></li><li><p>   <em>Tomato Quintet</em> (2007, 2011) de Chris Chafe sonifica el proceso de maduración de tomates. El proceso de maduración mapeó el CO2, la temperatura y las lecturas de luz de sensores en cada recipiente a parámetros de síntesis y procesamiento. Posteriormente, la duración de la sonificación resultante fue acelerada en diferentes escalas temporales.               </p></li></ul>"
        },
        "mapping-in-the-app": {
            "mapping-in-app": "<h2 id=\"mapping-in-the-app\">Mapeo en la App</h2> <br> <p style=\"text-align: center; zoom: 180%;\">     <img src=\"media/StEg_mapping_table.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"Mapping table in the app\"> &nbsp;&nbsp;&nbsp;     <img src=\"media/StEg_sonic_params.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"Sonic parameters\"> </p> <p style=\"text-align: center\">     <img src=\"media/StEg_mapping.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"Mapping topology\">     <img src=\"media/StEg_mapping_2.png\"style=\"background:none; border:none; box-shadow:none; width: clamp(500px, 30vw, 85vw);\"title=\"Mapping topology\"> </p>"
        },
        "instructions-title": {
            "instructions-title": "Instrucciones de la App"
        },
        "instructions": {
            "app-instructions": "1. Elige un conjunto de datos. Hay un menú desplegable de [x número] conjuntos de datos para elegir.<ol start=\"2\"><li><p>Selecciona la fila inicial de los datos para la sonificación.</p></li><li><p>Selecciona el número deseado de filas consecutivas de datos para añadir a la sonificación.</p></li><li><p>Elige tu instrumento. El instrumento predeterminado es un oscilador básico.</p></li><li><p>Selecciona el tipo de oscilador si es apropiado y añade cualquier número de efectos deseados.</p></li><li><p>En la tabla de mapeo, elige qué parámetros de sonido (eje horizontal) se asignan a cada parámetro de datos (eje vertical).</p></li><li><p>Utiliza los deslizadores verticales para ajustar los rangos de los parámetros de sonido.</p></li><li><p>Elige si deseas reproducirlo como un acorde o secuencia.</p></li><li><p>Selecciona tu escala preferida y ajusta el tempo.</p></li><li><p>Presiona PLAY para escuchar el sonido.</p></li><li><p>Presiona STOP para detener el sonido.</p></li><li><p>Cambia el mapeo, o cualquier configuración anterior y vuelve a escuchar.</p></li><li><p>También puedes hacer un bucle del sonido haciendo clic en el botón de flecha circular.</p></li><li><p>Una vez que estés satisfecho con el sonido, presiona el botón más. Esto guardará el sonido en un botón abajo a la derecha y cambiará de color a naranja. Puedes quitar cualquier sonido añadido presionando el botón menos.</p></li><li><p>Presiona el botón para escuchar el sonido nuevamente.</p></li><li><p>Crea hasta 9 sonidos. Presiona los botones para empezar a crear un ritmo, combinación o secuencia musical con los sonidos. También puedes usar las teclas de número correspondientes del teclado (1-9) para activar los sonidos.</p></li><li><p>Puedes grabar tu sesión y guardarla como un archivo de audio <em>.wav</em>. Presiona el botón circular una vez para empezar la grabación. Presiona de nuevo para detener.</p></li></ol><p><br><strong>NOTA</strong>: Actualmente puedes añadir, quitar y sobrescribir los sonidos guardados de forma cronológica.</p><p style=\"text-align: center\">    <br>    <a href=\"#/about\">Volver al video de demostración</a>    <br><br>    <!-- Link to the app here-->    <a href=\"https://beast.cal.bham.ac.uk/sounding/index.html\"style=\"font-size:1.5em;\"target=\"_blank\">Ir a la App</a></p>"
        }
    },
    "menubar": {
        "menubar.go_to": "Ir a…",
        "menubar.link_app": "App Sonificando el Epigenoma",
        "menubar.link_membra": "MEMBRA",
        "menubar.link_uniandes": "Universidad de los Andes",
        "menubar.link_cna": "Centro Nacional de las Artes"
    }
}